# -*- coding: UTF-8 -*-

'''--------------------第一题--------------------'''

'''
将数组里的每一个0都变成两个0

例：
输入 arr = [1,0,2,3,0,4,5,0]
返回：无
arr被更改为[1,0,0,2,3,0,0,4,5,0,0]

例2：
输入 arr = [1,2,3]
返回：无
arr被更改为[1,2,3]

例3：
输入 arr = []
返回：无
arr被更改为[]
'''

def doubleTheZero(arr):
    """
    doubleTheZero不返回任何值, 而是原地修改函数输入的数组arr
    """



'''--------------------第二题--------------------'''

'''
把arr里任何值等于val的元素删除

例：
输入 arr=[1,2,3,5,3] val=3
返回：无
arr被更改为[1,2,5]

例2：
输入 arr=[1,2,3] val=6
返回：无
arr被更改为[1,2,3]
'''

def removeElement(arr, val):
    """
    removeElement不返回任何值, 而是原地修改函数输入的数组arr
    """

    
    
'''--------------------第三题--------------------'''

'''
判断arr中是否有 任意数 N 和 M = 2N

例：
输入: arr = [10,2,5,3]
返回: true
'''
def checkIfExist(arr):
    """
    函数返回布尔值
    """


'''--------------------第四题--------------------'''

'''
把每个arr中的元素都替换成那个元素右边元素中的值最大的元素，如果右边没有元素，则将那个元素替换为-1
在那之后返回arr

例：
输入: arr = [17,18,5,4,6,1]
返回: [18,6,6,6,1,-1]
'''

def replaceElements(arr):
    """
    replaceElements返回修改后的arr
    """
